<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Int_SQL_Data_Analytics_Course/blob/main/1_Pivot_With_Case_Statements/2_Conditional_Aggregation.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Conditional Aggregation

**Product focused**

## Overview

### ü•Ö Analysis Goals

Use the following to do an EDA of the products and their categories ordered from the `sales` table.
- Compare total sales of products ordered in 2023 and 2022
- Total sales in 2023 and 2022.
- Categorize sales as low, moderate or high and pivot the sales by category and year.

### üìò Concepts Covered

- `SUM` Review
- `SUM` with `CASE WHEN`
- Pivot with Multiple CASE WHEN Statements

---

In [21]:
import sys
import matplotlib.pyplot as plt
%matplotlib inline

# If running in Google Colab, install PostgreSQL and restore the database
if 'google.colab' in sys.modules:
    # Install PostgreSQL
    !sudo apt-get install postgresql -qq > /dev/null 2>&1

    # Start PostgreSQL service (suppress output)
    !sudo service postgresql start > /dev/null 2>&1

    # Set password for the 'postgres' user to avoid authentication errors (suppress output)
    !sudo -u postgres psql -c "ALTER USER postgres WITH PASSWORD 'password';" > /dev/null 2>&1

    # Create the 'colab_db' database (suppress output)
    !sudo -u postgres psql -c "CREATE DATABASE contoso_100k;" > /dev/null 2>&1

    # Download the PostgreSQL .sql dump
    !wget -q -O contoso_100k.sql https://github.com/lukebarousse/Int_SQL_Data_Analytics_Course/releases/download/v.0.0.0/contoso_100k.sql

    # Restore the dump file into the PostgreSQL database (suppress output)
    !sudo -u postgres psql contoso_100k < contoso_100k.sql > /dev/null 2>&1

    # Shift libraries from ipython-sql to jupysql
    !pip uninstall -y ipython-sql > /dev/null 2>&1
    !pip install jupysql > /dev/null 2>&1

# Load the ipython-sql extension for SQL magic
%load_ext sql

# Connect to the PostgreSQL database
%sql postgresql://postgres:password@localhost:5432/contoso_100k

# Enable automatic conversion of SQL results to pandas DataFrames
%config SqlMagic.autopandas = True

# Disable named parameters for SQL magic
%config SqlMagic.named_parameters = "disabled"

# Set up the connection parameters for this notebook
import psycopg2
import pandas as pd
import numpy as np

# Database connection parameters
connection = psycopg2.connect(
    dbname='contoso_100k',
    user='postgres',
    password='password',
    host='localhost',
    port='5432'
)

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting and switching to connection 'postgresql://postgres:***@localhost:5432/contoso_100k'

---
## SUM Review

### üìù¬†Notes

- Add in specific notes

### üíª¬†Final Result

- Describe what the final result should be e.g. return the retention by X cohort.

#### Total Sales by Category for 2022 and 2023

**`FUNCTION` / Concept Covered**

1. Find the total sales for each entry by multiplying `quantity` (which is from the `sales` table) by the `price` in the `product` table and `exchangerate` (since not all sales are made in `USD`).

2. Filter the data to only return data from 2023 and return the `categoryname`.

In [23]:
%%sql

SELECT
    s.orderkey,
    s.orderdate,
    s.customerkey,
    s.storekey,
    s.productkey,
    p.categoryname,
    s.quantity,
    s.unitprice,
    s.quantity * s.unitprice * s.exchangerate AS total_sale_amount
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
WHERE
    s.orderdate::date BETWEEN '2023-01-01' AND '2023-12-31' --Added
ORDER BY
    s.orderkey

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

37517 rows affected.

,orderkey,orderdate,customerkey,storekey,productkey,categoryname,quantity,unitprice,total_sale_amount
0,2923000,2023-01-01,239821,90,1581,"Music, Movies and Audio Books",7,219.00,2075.421390
1,2923001,2023-01-01,1025340,999999,2013,Home Appliances,1,665.94,553.762407
2,2923002,2023-01-01,686958,120,1602,"Music, Movies and Audio Books",3,179.99,506.254273
3,2923002,2023-01-01,686958,120,349,Computers,1,383.00,359.085480
4,2923002,2023-01-01,686958,120,1644,"Music, Movies and Audio Books",1,57.88,54.265973
...,...,...,...,...,...,...,...,...,...
37512,3287006,2023-12-31,334289,999999,1440,Cell phones,1,189.00,250.438230
37513,3287007,2023-12-31,1398584,480,786,Computers,2,11.50,23.000000
37514,3287007,2023-12-31,1398584,480,1463,Cell phones,3,293.00,879.000000
37515,3287007,2023-12-31,1398584,480,1527,Cell phones,1,268.00,268.000000
37516,3287008,2023-12-31,396403,90,1455,Cell phones,3,290.00,1152.810900

3. Aggregegate the data to get the total sales by category. 
    - Remove other columns except for category
    - Aggregate by category

In [24]:
%%sql

SELECT
    p.categoryname AS category_name,
    SUM(s.quantity * s.unitprice * s.exchangerate) AS total_sale_amount -- Added
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
WHERE
    s.orderdate::date BETWEEN '2023-01-01' AND '2023-12-31'
GROUP BY
    p.categoryname -- Added
ORDER BY
    p.categoryname -- Added

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

                   category_name  total_sale_amount
0                          Audio       7.306479e+05
1        Cameras and camcorders        2.107966e+06
2                    Cell phones       6.383098e+06
3                      Computers       1.237377e+07
4                 Games and Toys       2.864817e+05
5                Home Appliances       6.317839e+06
6  Music, Movies and Audio Books       2.321667e+06
7                   TV and Video       4.699135e+06

4. For 2022 edit the date filter in the `WHERE` clause to be 2022.

In [25]:
%%sql

SELECT
    p.categoryname AS category_name,
    SUM(s.quantity * s.unitprice * s.exchangerate) AS total_sale_amount
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
WHERE
    s.orderdate::date BETWEEN '2022-01-01' AND '2022-12-31' -- Updated
GROUP BY
    p.categoryname
ORDER BY
    p.categoryname

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

                   category_name  total_sale_amount
0                          Audio       8.144389e+05
1        Cameras and camcorders        2.539234e+06
2                    Cell phones       8.623592e+06
3                      Computers       1.900305e+07
4                 Games and Toys       3.356832e+05
5                Home Appliances       7.026622e+06
6  Music, Movies and Audio Books       3.178853e+06
7                   TV and Video       6.187337e+06

---
## SUM with CASE WHEN

### üìù¬†Notes

- Add in specific notes

### üíª¬†Final Result

- Describe what the final result should be e.g. return the retention by X cohort.

#### Total Sales by Category and Year

**`CASE WHEN` and `SUM`**

1. Pivot to get the total sales by category and compare 2023 with 2022.

In [26]:
%%sql 

SELECT
    p.categoryname AS category,
    SUM(CASE WHEN s.orderdate::date BETWEEN '2023-01-01' AND '2023-12-31' THEN (s.quantity * s.unitprice * s.exchangerate) END) AS y2023_total_sales,
    SUM(CASE WHEN s.orderdate::date BETWEEN '2022-01-01' AND '2022-12-31' THEN (s.quantity * s.unitprice * s.exchangerate) END) AS y2022_total_sales
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
GROUP BY
    p.categoryname
ORDER BY
    p.categoryname;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

                        category  y2023_total_sales  y2022_total_sales
0                          Audio       7.306479e+05       8.144389e+05
1        Cameras and camcorders        2.107966e+06       2.539234e+06
2                    Cell phones       6.383098e+06       8.623592e+06
3                      Computers       1.237377e+07       1.900305e+07
4                 Games and Toys       2.864817e+05       3.356832e+05
5                Home Appliances       6.317839e+06       7.026622e+06
6  Music, Movies and Audio Books       2.321667e+06       3.178853e+06
7                   TV and Video       4.699135e+06       6.187337e+06

---
## Pivot with Multiple CASE WHEN Statements

### üìù¬†Notes

- Add in specific notes

### üíª¬†Final Result

- Describe what the final result should be e.g. return the retention by X cohort.

#### Categorize as Low, Moderate and High for Total Sale

**`FUNCTION` / Concept Covered**

1. Find the minimum, 25th percentile, 75th percentile, and maximum for a single total sale made in 2022 and 2023.

To categorize sales into low, moderate, and high, we'll use the 25th percentile (Q1) and 75th percentile (Q3). It lets us segment the data into three meaningful categories, instead of guessing:

- **Low**: Below the 25th percentile (Q1).
- **Moderate**: Between the 25th and 75th percentiles (Q1 and Q3).
- **High**: Above the 75th percentile (Q3).

To calculate the percentiles (25th, 50th, and 75th) 
- **`PERCENTILE_CONT`** calculates a percentile (e.g., 25th, 50th, 75th) by estimating values between sorted data points.  
- Syntax:
```sql
SELECT 
  PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY column_name) AS median
FROM table_name
WHERE column_name IS NOT NULL;
```

In [27]:
%%sql 

SELECT
    MIN(s.quantity * s.unitprice * exchangerate) AS minimum_sales,
    PERCENTILE_CONT(0.25) WITHIN GROUP (ORDER BY (s.quantity * s.unitprice * exchangerate)) AS q1_sales,
    PERCENTILE_CONT(0.75) WITHIN GROUP (ORDER BY (s.quantity * s.unitprice * exchangerate)) AS q3_sales,
    MAX(s.quantity * s.unitprice * exchangerate) AS maximum_sales
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
WHERE
    orderdate::date BETWEEN '2022-01-01' AND '2023-12-31' 
;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

1 rows affected.

   minimum_sales  q1_sales  q3_sales  maximum_sales
0       0.864576     118.0    1128.0    38082.66084

2. **Validate data**. Validating data another way using Python.

**Note for Luke**: We could also say they could export the data in Excel but it might not load quickly on their computer.

In [28]:
# SQL Query to fetch data
query = '''
SELECT 
    s.quantity * s.unitprice * exchangerate AS total_sale_amount
FROM 
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
WHERE
    orderdate::date BETWEEN '2022-01-01' AND '2023-12-31' 
ORDER BY 
    total_sale_amount;
'''

# Fetch data into a Pandas DataFrame
sales_df = pd.read_sql_query(query, connection)

import warnings

# Suppress specific warning from Pandas about psycopg2
warnings.filterwarnings(
    'ignore',
    category=UserWarning,
    message=".*only supports SQLAlchemy connectable.*"
)


# Calculate percentiles
q1 = np.percentile(sales_df, 25)
q3 = np.percentile(sales_df, 75)

print(f"25th Percentile (Q1): {q1}")
print(f"75th Percentile (Q3): {q3}")

25th Percentile (Q1): 118.0
75th Percentile (Q3): 1128.0

3. Pivot by category and then categorize the sale into low, moderate and high based on the 25th, 50th, and 75th percentile for sales in 2022 and 2023. Then get the total sale amount.

In [29]:
%%sql 

SELECT
    p.categoryname AS category,
    SUM(CASE WHEN (s.quantity * s.unitprice * exchangerate) < 114.59 THEN (s.quantity * s.unitprice * exchangerate) END) AS low_total_sales,
    SUM(CASE WHEN (s.quantity * s.unitprice * exchangerate) >= 114.59 AND (s.quantity * s.unitprice * exchangerate) < 1064.00 THEN (s.quantity * s.unitprice * exchangerate) END) AS mod_total_sales,
    SUM(CASE WHEN (s.quantity * s.unitprice * exchangerate) >= 1064.00 THEN (s.quantity * s.unitprice * exchangerate) END) AS high_total_sales
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
WHERE
    orderdate::date BETWEEN '2022-01-01' AND '2023-12-31' 
GROUP BY
    category
ORDER BY
    category;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

,category,low_total_sales,mod_total_sales,high_total_sales
0,Audio,48645.534494,9.788434e+05,5.175978e+05
1,Cameras and camcorders,22033.305577,9.161693e+05,3.708998e+06
2,Cell phones,211053.242184,5.222102e+06,9.573535e+06
3,Computers,113554.564758,5.161734e+06,2.610153e+07
4,Games and Toys,198526.011477,3.831928e+05,4.044602e+04
5,Home Appliances,34252.624856,1.672944e+06,1.163726e+07
6,"Music, Movies and Audio Books",281043.885642,2.853328e+06,2.366148e+06
7,TV and Video,21475.979833,1.773837e+06,9.091159e+06

4. Add in the year to pivot by category, sale amount and year to compare 2023 vs 2022 sales for the sales label.

In [30]:
%%sql 

SELECT
    p.categoryname AS category,
    SUM(CASE WHEN (s.quantity * s.unitprice * exchangerate) < 114.59
        AND orderdate::date BETWEEN '2023-01-01' AND '2023-12-31' THEN (s.quantity * s.unitprice * exchangerate) END) AS y2023_low_total_sales,
    SUM(CASE WHEN (s.quantity * s.unitprice * exchangerate) >= 114.59 AND (s.quantity * s.unitprice * exchangerate) < 1064.00 
        AND orderdate::date BETWEEN '2023-01-01' AND '2023-12-31' THEN (s.quantity * s.unitprice * exchangerate) END) AS y2023_mod_total_sales,
    SUM(CASE WHEN (s.quantity * s.unitprice * exchangerate) >= 1064.00 
        AND orderdate::date BETWEEN '2023-01-01' AND '2023-12-31' THEN (s.quantity * s.unitprice * exchangerate) END) AS y2023_high_total_sales,
    SUM(CASE WHEN (s.quantity * s.unitprice * exchangerate) < 114.59 
        AND orderdate::date BETWEEN '2022-01-01' AND '2022-12-31' THEN (s.quantity * s.unitprice * exchangerate) END) AS y2022_low_total_sales,
    SUM(CASE WHEN (s.quantity * s.unitprice * exchangerate) >= 114.59 AND (s.quantity * s.unitprice * exchangerate) < 1064.00 
        AND orderdate::date BETWEEN '2022-01-01' AND '2022-12-31' THEN (s.quantity * s.unitprice * exchangerate) END) AS y2022_mod_total_sales,
    SUM(CASE WHEN (s.quantity * s.unitprice * exchangerate) >= 1064.00 
        AND orderdate::date BETWEEN '2022-01-01' AND '2022-12-31' THEN (s.quantity * s.unitprice * exchangerate) END) AS y2022_high_total_sales
FROM    
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
GROUP BY
    category
ORDER BY
    category;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

,category,y2023_low_total_sales,y2023_mod_total_sales,y2023_high_total_sales,y2022_low_total_sales,y2022_mod_total_sales,y2022_high_total_sales
0,Audio,20323.109896,4.447811e+05,2.655437e+05,28322.424598,5.340624e+05,2.520541e+05
1,Cameras and camcorders,10786.242390,4.157904e+05,1.681389e+06,11247.063187,5.003789e+05,2.027608e+06
2,Cell phones,95435.786047,2.472805e+06,3.814857e+06,115617.456137,2.749297e+06,5.758678e+06
3,Computers,57090.218488,2.284592e+06,1.003209e+07,56464.346270,2.877142e+06,1.606944e+07
4,Games and Toys,90668.263703,1.795388e+05,1.627462e+04,107857.747774,2.036540e+05,2.417139e+04
5,Home Appliances,16079.263003,7.542349e+05,5.547525e+06,18173.361852,9.187090e+05,6.089740e+06
6,"Music, Movies and Audio Books",133228.202369,1.262702e+06,9.257367e+05,147815.683273,1.590626e+06,1.440411e+06
7,TV and Video,7811.140475,7.219441e+05,3.969380e+06,13664.839358,1.051893e+06,5.121779e+06